{
  "section": "Section 2",
  "format": "Monologue",
  "topic": "Environmental Initiatives at University",
  "speaker": "University Sustainability Officer (Sarah Martinez)",
  "duration_target": "2-3 minutes",
  "introduction": "You will hear a talk by the University Sustainability Officer about new environmental initiatives on campus.",
  "full_monologue": "Good morning, students. I'm Sarah Martinez, the University Sustainability Officer, and I'm here today to tell you about some exciting new environmental initiatives that we're launching this semester at Greenfield University.\n\nFirst of all, I want to talk about our new campus-wide recycling program. Starting next Monday, you'll notice new recycling bins throughout the campus. These aren't just your ordinary bins - they're smart bins equipped with sensors that can sort different types of materials automatically. You'll find separate compartments for paper, plastic, glass, and organic waste. The bins are strategically placed in all academic buildings, dormitories, and common areas, including the library, student center, and dining halls.\n\nThe second initiative I'd like to highlight is our bike-sharing program. We've partnered with EcoRide to provide 200 bicycles available for student use completely free of charge. You can find bike stations at five key locations around campus: the main entrance, the sports complex, the library, the science building, and the student accommodation area. To use a bike, simply download the EcoRide app, scan the QR code on any available bicycle, and you're ready to go. Each bike can be used for up to two hours at a time, and you can return it to any of the five stations.\n\nOur third major project focuses on energy conservation in student accommodation. We're installing solar panels on all dormitory rooftops, which will generate approximately 40% of the electricity needed for these buildings. Additionally, we're upgrading all windows to double-glazed energy-efficient ones and installing smart heating systems that automatically adjust temperature based on occupancy and weather conditions.\n\nNow, let me tell you about our green spaces initiative. We're creating three new community gardens where students can grow their own vegetables and herbs. The gardens will be located behind the library, next to the sports complex, and in the central courtyard area. Each student can reserve a small plot for the academic year at no cost. We'll provide all the basic tools, seeds, and guidance you need to get started. This is a fantastic opportunity to learn about sustainable agriculture while enjoying fresh, organic produce.\n\nFinally, I want to mention our new Environmental Club, which meets every Thursday at 6 PM in room 205 of the student center. The club organizes various activities throughout the year, including tree-planting events, campus clean-up days, and educational workshops on topics like composting and energy conservation. Membership is open to all students, and no previous experience with environmental issues is required.\n\nTo support all these initiatives, we've also launched a points-based reward system called Green Points. You earn points for participating in environmental activities - using the bike-sharing program, properly sorting your recyclables, joining club events, or maintaining a community garden plot. These points can be redeemed for various rewards, including discounts at the campus bookstore, free meals at the cafeteria, and even priority registration for popular courses.\n\nIf you have any questions about these programs or would like to get involved, please don't hesitate to contact me. My office is located on the second floor of the administration building, room 214, and my office hours are Monday through Friday from 9 AM to 4 PM. You can also email me at s.martinez@greenfield.edu.\n\nThank you for your attention, and I look forward to seeing your participation in making our campus more environmentally friendly.",
  "metadata": {
    "word_count": 518,
    "estimated_duration_minutes": 2.8,
    "complexity_level": "IELTS Band 6-7",
    "topic_category": "Environment and Education",
    "speaker_profile": "Professional female, informative, encouraging",
    "key_numbers": [
      "200 bicycles",
      "5 stations",
      "2 hours",
      "40%",
      "3 gardens",
      "Thursday 6 PM",
      "room 205",
      "room 214",
      "9 AM to 4 PM"
    ],
    "listening_skills_tested": [
      "Following a structured presentation",
      "Understanding specific details and numbers",
      "Identifying location and time information",
      "Comprehending program benefits and requirements"
    ]
  },
  "audio_generation": {
    "engine": "pyttsx3",
    "voice_used": "female",
    "file_path": "ielts_section2_offline/ielts_section2_environmental_initiatives_offline.wav",
    "quality": "standard",
    "mode": "offline",
    "iranian_compliant": true,
    "continuous_format": true,
    "authentic_timing": true
  }
}